ArteryTek/AT32F011_Firmware_Library/libraries/drivers/inc/at32f011_gpio.h
/**
  **************************************************************************
  * @file     at32f011_gpio.h
  * @brief    at32f011 gpio header file
  **************************************************************************
  *
  * Copyright (c) 2025, Artery Technology, All rights reserved.
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

/**
  porta iomux table
  --------------------------------------------------------------------------------------------------------------------------------
  pin name     |    mux0     |    mux1     |     mux2    |    mux3     |    mux4      |   mux5      |    mux6     |   mux7       |
  --------------------------------------------------------------------------------------------------------------------------------
  pa0          |  usart2_rx  |  usart2_cts |             |   i2c2_scl  |  usart4_tx   |  tmr1_etr   |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa1          |             |  usart2_rts |             |   i2c2_sda  |  usart4_rx   |  tmr15_ch1c |  i2c1_smba  |  eventout    |
  --------------------------------------------------------------------------------------------------------------------------------
  pa2          |  tmr15_ch1  |  usart2_tx  |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa3          |  tmr15_ch2  |  usart2_rx  |             |             |              |  i2s2_mck   |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa4          |  spi1_nss   |  usart2_ck  |             |             |  tmr14_ch1   |  i2c1_scl   |  spi2_nss   |              |
               |  i2s1_ws    |             |             |             |              |             |  i2s2_ws    |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa5          |  spi1_sck   |             |             | usart3_ck   |  usart3_rx   |             |             |              |
               |  i2s1_ck    |             |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa6          |  spi1_miso  |  tmr3_ch1   |  tmr1_bkin  | usart3_rx   |  usart3_cts  |  tmr16_ch1  |  i2s2_mck   |  eventout    |
               |  i2s1_mck   |             |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa7          |  spi1_mosi  |  tmr3_ch2   |  tmr1_ch1c  | usart3_tx   |  tmr14_ch1   |  tmr17_ch1  |  eventout   |              |
               |  i2s1_sd    |             |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa8          |  clkout     |  usart1_ck  |  tmr1_ch1   |   eventout  |  usart2_tx   |             |             |  i2c2_scl    |
  --------------------------------------------------------------------------------------------------------------------------------
  pa9          | tmr15_bkin  |  usart1_tx  |   tmr1_ch2  |             |  i2c1_scl    |  clkout     |             |  i2c2_smba   |
  --------------------------------------------------------------------------------------------------------------------------------
  pa10         | tmr17_bkin  |  usart1_rx  |  tmr1_ch3   |             |  i2c1_sda    |  rtc_refin  |             |  i2c2_smba   |
  --------------------------------------------------------------------------------------------------------------------------------
  pa11         |             |  usart1_cts |  tmr1_ch4   |             |              |  i2c2_scl   |  i2c1_smba  |  eventout    |
  ----------------------------- --------------------------------------------------------------------------------------------------
  pa12         |             |  usart1_rts |  tmr1_etr   |             |              |  i2c2_sda   |             |  eventout    |
  --------------------------------------------------------------------------------------------------------------------------------
  pa13         | swdio       |  ir_out     |             |             |              |  i2c1_sda   |   spi2_miso |              |
               |             |             |             |             |              |             |   i2s2_mck  |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa14         | swclk       |  usart2_tx  |             |             |              |  i2c1_smba  |   spi2_mosi |              |
               |             |             |             |             |              |             |   i2s2_sd   |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pa15         | spi1_nss    |  usart2_rx  |             |             |  usart2_rts  |             |   spi2_nss  |              |
               | i2s1_ws     |             |             |  eventout   |              |             |   i2s2_ws   |              |
  --------------------------------------------------------------------------------------------------------------------------------
  */

/**
  portb iomux table
  --------------------------------------------------------------------------------------------------------------------------------
  pin name     |    mux0     |    mux1     |     mux2    |    mux3     |    mux4      |   mux5      |    mux6     |   mux7       |
  --------------------------------------------------------------------------------------------------------------------------------
  pb0          |             |   tmr3_ch3  |   tmr1_ch2c |  usart2_rx  |  usart3_ck   |  eventout   |  i2s1_mck   |   spi1_miso  |
               |             |             |             |             |              |             |             |   i2s1_mck   |
  --------------------------------------------------------------------------------------------------------------------------------
  pb1          |   tmr14_ch1 |   tmr3_ch4  |   tmr1_ch3c |  usart2_ck  |  usart3_rts  |             |  spi2_sck   |  spi1_mosi   |
               |             |             |             |             |              |             |  i2s2_ck    |  i2s1_sd     |
  --------------------------------------------------------------------------------------------------------------------------------
  pb2          |             |             |   tmr3_etr  |             |              |             |             |  i2c1_smba   |
  --------------------------------------------------------------------------------------------------------------------------------
  pb3          |   spi1_sck  |   eventout  |             |             |  usart1_rts  | usart2_cts  |  spi2_sck   |              |
               |   i2s1_ck   |             |             |             |              |             |  i2s2_ck    |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb4          |   spi1_miso |   tmr3_ch1  |   eventout  |             |  usart1_cts  | tmr17_bkin  |  spi2_miso  |  i2c2_sda    |
               |   i2s1_mck  |             |             |             |              |             |  spi2_mck   |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb5          |   spi1_mosi |   tmr3_ch2  |  tmr16_bkin | i2c1_smba   |  usart1_ck   | usart2_rts  |  spi2_mosi  |              |
               |   i2s1_sd   |             |             |             |              |             |  i2s2_sd    |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb6          |   usart1_tx |   i2c1_scl  |  tmr16_ch1c |             |  usart4_ck   |             |  i2s1_mck   |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb7          |   usart1_rx |   i2c1_sda  |  tmr17_ch1c |             |  usart4_cts  |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb8          |   usart1_tx |   i2c1_scl  |  tmr16_ch1  |  eventout   |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb9          |   ir_out    |   i2c1_sda  |  tmr17_ch1  |  eventout   |              |             |  i2s1_mck   |   spi2_nss   |
               |             |             |             |             |              |             |             |   i2s2_ws    |
  --------------------------------------------------------------------------------------------------------------------------------
  pb10         |             |   i2c2_scl  |             |             |  usart3_tx   |             |             |   spi2_sck   |
               |             |             |             |             |              |             |             |   i2s2_ck    |
  --------------------------------------------------------------------------------------------------------------------------------
  pb11         |             |   i2c2_sda  |             |  eventout   |  usart3_rx   |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb12         |   spi2_nss  |   eventout  |  tmr1_bkin  |             |  usart3_ck   |  tmr15_bkin |             |   i2c2_smba  |
               |   i2s2_ws   |             |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb13         |   spi2_sck  |  tmr15_ch1c |  tmr1_ch1c  |   clkout    |  usart3_cts  |  i2c2_scl   |             |              |
               |   i2s2_ck   |             |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb14         |   spi2_miso |  tmr15_ch1  |  tmr1_ch2c  |             |  usart3_rts  |  i2c2_sda   |             |              |
               |   i2s2_mck  |             |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pb15         |   spi2_mosi |  tmr15_ch2  |  tmr1_ch3c  | tmr15_ch1c  |              |  rtc_refin  |             |              |
               |   i2s2_sd   |             |             |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
*/

/**
  portf iomux table
  --------------------------------------------------------------------------------------------------------------------------------
  pin name     |    mux0     |    mux1     |     mux2    |    mux3     |    mux4      |   mux5      |    mux6     |   mux7       |
  --------------------------------------------------------------------------------------------------------------------------------
  pf0          |             |   i2c1_sda  |  tmr1_ch1   |             |              |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf1          |             |   i2c1_scl  |  tmr1_ch2c  |             |              |             |  spi2_nss   |              |
               |             |             |             |             |              |             |  i2s2_ws    |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf6          |  i2c2_scl   |             |             |             |  usart4_rx   |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
  pf7          |  i2c2_sda   |             |             |             |  usart4_tx   |             |             |              |
  --------------------------------------------------------------------------------------------------------------------------------
*/


/* define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F011_GPIO_H
#define __AT32F011_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif


